Revit 2027 API
BuiltInFailures.RefPlaneFailures.AlreadyHaveTwoClosurePlanes Property
 No more than two closure planes are allowed.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId AlreadyHaveTwoClosurePlanes { get; }
Public Shared ReadOnly Property AlreadyHaveTwoClosurePlanes As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ AlreadyHaveTwoClosurePlanes {
	FailureDefinitionId^ get ();
}
static member AlreadyHaveTwoClosurePlanes : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.RefPlaneFailures Class
Autodesk.Revit.DB Namespace